Repository: clintonb/edx-marketing-site-frontend
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_419

source: View Courses
es_419: Ver Cursos

source: Meet the Instructors
es_419: Conoce a los Instructores

source: The %(type)s
es_419: Los%(type)s

source: Skip the %(type)s Main Overview
es_419: Omitir los%(type)s Vista Principal

source: A series of courses that add up to a rich understanding of an area of study.
es_419: Series de cursos que suman a un rico entendimiento de un área de estudio.

source: A series of credit-eligible courses recognized by industry.
es_419: Series de cursos elegibles para créditos reconocidos por la industria.

source: A series of career-oriented courses to develop in-demand skills.
es_419: Series de cursos orientados a carrera para desarrollar habilidades en demanda.

source: See more
es_419: Ver más

source: about %(title)s
es_419: sobre %(title)s

source: Hide
es_419: Ocultar

source: %(type)s Details
es_419: %(type)s Detalles

source: About %(type)s
es_419: Sobre %(type)s

source: Courses
es_419: Cursos

source: Instructors
es_419: Instructores

source: bio for %(title)s
es_419: bio para %(title)s

source: View a PDF of a sample %(type)s Certificate
es_419: Ver un PDF como ejemplo %(type)s Certificado

source: Image of %(name)s
es_419: Imagen de %(name)s

source: Courses taught by %(name)s
es_419: Cursos impartidos por %(name)s

source: %(site_name)s home page
es_419: Página de inicio de %(courseName)s.

source: Programs
es_419: Programas

source: Schools & Partners
es_419: Universidades

source: About
es_419: Acerca de

source: Search
es_419: Buscar

source: Dashboard
es_419: Panel de información

source: Profile
es_419: Perfil

source: Account
es_419: Cuenta

source: Sign Out
es_419: Cerrar sesión
